import React from 'react'
import Catalog from '../../components/Catalog/Catalog'
import Footer from '../../components/Footer/Footer'
import Main from '../../components/main/Main'
import Navbar from '../../components/navbar/Navbar'
import "./mainPage.css"
const MainPage = () => {
    return (
        <div>
            <Main />
            <div className='Catalog__block'>
                <div className='catalog__flex'>
                    <h2>Тігілген модельдер мен үлгілердін сапасын бакылау</h2>
                    <p className="text-bottom">Тігілген модельдер мен үлгілердін сапасым бакылау дегеніміз, модельдерді жасау кезін туындау және олардың маңызды параметрлерін тапсыру арқылы модельдердің сапасын бақылау процесін айтады. <br/><br/>
                        Тігілген модельдер деректерді түсіну, деректерді ойлау және оларды анықтау үшін алгоритмдерді пайдаланады. Олар оқып, деректерді анализдау процесін айналдырады. Мысалы, тілге байланысты деректерді анықтау үшін, тілге ортақ сөздерді (n-граммаларды) жасауға болады. Оларда жылдамдықты теңшеуге арналған алгоритмдер жинақталған.</p>
                    {/* <Catalog link={"/razdel/test"} imgLink={"https://g.foolcdn.com/image/?url=https%3A//g.foolcdn.com/editorial/images/641777/worker-does-quality-control-on-medical-device.jpg&w=2000&op=resize"} name={"Тест"} option={""}/>
                    <Catalog link={"/razdel/praktika"} imgLink={"https://sc04.alicdn.com/kf/Hea4a6d01646c4648a06e29c2a328bc64H/253448907/Hea4a6d01646c4648a06e29c2a328bc64H.jpg"} name={"Практика"} option={""}/> */}
                    <Catalog link={"/razdel/lesson"} imgLink={"https://sc02.alicdn.com/kf/U0f4f7785b8244fb188530fc6556eea145/985537082/U0f4f7785b8244fb188530fc6556eea145.jpg"} name={"Лекция"} option={""}/>
                    <h2>Тігін ондіріснің технологиясы</h2>
                    <p className="text-bottom">
                        Тігін ондіріснің технологиясы бірнеше көлемді суды дайындау, құралдарды қамтамасыз ету және энергияны қолдану пайдаланылады. Бұл технологияларда көмекші элементтерді пайдалану, су тігу көлемін азайту, жер түгелдерін жеткізу және су ауыстыру процесін жоғары сапада жүзеге асырудың бірнеше жолы қолданылады. <br/><br/>
                        Тігін ондірісінің технологиясында су тігу процесінің негізгі мәселелері арасында дереккөздікті, тігу бағдарламаларын, су жиілігін, амбарлықтықты және жер түгелдерін жеткізуді, су ауыстыру технологиясын, даму технологияларын және ауыстыру құралдарын қамтамасыз ету процесінің жағдайлары толықтыру керек.
                    </p>
                    <Catalog link={"/razdel/srs"} imgLink={"https://www.tkanix.info/moda/kak-sshit-platye-soveti-i-vikroyki-dlya-nachinayushchih/kak-sshit-platye-2.jpg"} name={"СӨЖ"} option={""}/>
                    <h2>Киімдерді кұрастыру</h2>
                    <p className="text-bottom">
                        Бұл дизайнерлер немесе техникалық қабілеттерге ие адамдар арасында қызығушы, творческий процес, киімдердің құрамын таңдау, жасау және модельдену процесіндегі жұмыс. Киімдерді курастыру кезінде дизайнерлер жаңа жобаларды құруда, модельдерді жасауда және жасаушылармен жұмыс жасауда көмек көрсетеді. <br/><br/>
                        Киімдерді курастыру процесінде киімнің құрамы мен шығару технологиясын таңдау керек. Дизайнерлер мода тенденцияларын, сонымен қатар клиенттердің талаптарын анықтау арқылы дамушыларға қолдау көрсетуі керек. Олар жаңа дизайндық идеяларды дамыту, модельді жасау жолдарын табу, жасаушыларды қолдау көрсету, жасау процесін бақылау, қарым-қатынасын туындау және киімнің соңғы жағдайына шешім беру процесін орындау міндеттерін жүргізеді.
                    </p>
                    <Catalog link={"/razdel/rk"} imgLink={"https://avatars.dzeninfra.ru/get-zen_brief/6404829/pub_630b4bca2b706d122c7709bf_630b5a4b5847ad612e35dd65/scale_1200"} name={"РК"} option={""}/>
                    <h2>Компютерлік моделдеу</h2>
                    <p className="text-bottom">
                        Бұл жасаушылардың компьютерлік моделдер арқылы техникалық немесе физикалық процестерді сынап көруге мүмкіндік беретін әдістер жиынтығы. Бұл модельдеу процесінің негізгі мақсаты, реальдық жағдайды компьютерлік моделдер арқылы теориялық немесе емделулік байланысты процестерге көбірек түсінік беру, анықтау және нәтижелерді анықтау. <br/><br/>
                        Компьютерлік моделдеу процесінің алғашқы қадамы, модельдерді жасау үшін математикалық теориялар, алгоритмдер мен дереккөздіктердің қолданылуы. Бұл теориялар, модельдерді жасау және оларды талаптарға сай модифицироватьлау арқылы жасаушылардың белгіленген мақсаттарына жетуге көмек көрсетеді. Модельдерді жасау кезінде көбірек параметрлерді, әрекеттерді және условияларды анықтау үшін математикалық теориялар пайдаланылады.
                    </p>
                    <Catalog link={"/razdel/mainTest"} imgLink={"https://sc01.alicdn.com/kf/Had698e4ec4214c8381b65385cfda5cbeZ/230824819/Had698e4ec4214c8381b65385cfda5cbeZ.jpg"} name={"Емтихан сұрақтары"} option={""}/>
                    <h2>Өндірістік оқыту</h2>
                    <p className="text-bottom">
                        Өндірістік оқыту - бұл практикалық білім беру процесі, жасыл әдістемелер мен жаңа технологияларды пайдалана отырып, студенттерге тәжірибелік білім беру, мәселелерді шешу және өздерінің талаптарына сәйкес көзделген құндылықтарды алуға негізделген білім беру әдістемесі. <br/><br/>
                        Өндірістік оқыту процесінің негізгі мақсаты, студенттердің теориялық білімін жадында, олардың қарым-қатынас және қазақстандық қоғамның сұранысына сай модифицироватьтау үшін практикалық жағдайларды жасау. Өндірістік оқыту арқылы студенттердің жеке өздік кәсіпорын табуы, қарым-қатынасын арттыруы және өзге тәжірибелерді жетілдіруге көмек көрсетіледі.
                    </p>
                    <h2>Кәсіптік практика</h2>
                    <p className="text-bottom">
                        Кәсіптік практика – бұл білім беру мүмкіндіктерін үздіктен өтеу, студенттерге жеке өздік тәжірибе алуға және кәсіпкерлік алаңдарында мамандықты қолдануға арналған курстық жүйе. Кәсіптік практика арқылы студенттер білімін толықтыру, теориялық білімін жадында өзгерту, жоба жасау және түзету, жеке өздік кәсіпорын табу, кәсіпкерлік алаңдарда жұмыс істеу мен өзге кәсіпорындармен байланыс орнату мүмкіндіктерін алады. <br/><br/>
                        Кәсіптік практиканың негізгі мақсаты – студенттерді өз алған мамандығындағы кәсіпкерлік алаңда, өздерінің мамандықтарына сай білім, тәжірибе жинау. Олар әлеуметтік кәсіпкерлермен бірге жұмыс жасау арқылы кәсіпкерлік күндізгі жұмыстарын, кәсіпкерлік процестерін, кәсіпорындармен байланысты технологияларды, қолдану және іске асыру әдістерін меңгеру мүмкіндіктерін жетілдіруге көмек көрсетеді.
                    </p>
                </div>
            </div>
        </div>
    )
}

export default MainPage